#+TITLE:XenHunt Config (org)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of org
#+STARTUP: content
#+PROPERTY: header-args :tangle tex-config.el
* AucTex
:PROPERTIES:
:CUSTOM_ID: auctex
:END:
#+begin_src emacs-lisp
(use-package auctex
  :custom
  (TeX-engine 'xetex)
  (TeX-command-extra-options "-shell-escape")
  (TeX-source-correlate-method 'synctex)
  (TeX-source-correlate-mode)
  (TeX-source-correlate-start-server t)
  (LaTeX-math-menu-unicode t)

  (TeX-auto-save t)
  (TeX-parse-self t)
  (TeX-master nil)
  (font-latex-fontify-sectioning 1.3)

  ;; Scale preview for my DPI
  (preview-scale-function 1.4)
  )
#+end_src

#+RESULTS:
: [nil 26910 38204 265866 nil elpaca-process-queues nil nil 534000 nil]

* Lsp-LaTex
:PROPERTIES:
:CUSTOM_ID: lsp-latex
:END:
#+begin_src emacs-lisp
(use-package lsp-latex
  :hook
  ((LaTeX-mode tex-mode TeX-mode) . lsp-deferred))
#+end_src

#+RESULTS:
: [nil 26916 41184 59615 nil elpaca-process-queues nil nil 425000 nil]

* Evil integration
:PROPERTIES:
:CUSTOM_ID: evil-integration
:END:
#+begin_src emacs-lisp
(use-package evil-tex
  :after evil
  :hook (LaTeX-mode . evil-tex-mode))
#+end_src

#+RESULTS:
: [nil 26916 44767 700195 nil elpaca-process-queues nil nil 486000 nil]

* Ebib
:PROPERTIES:
:CUSTOM_ID: ebib
:END:
#+begin_src emacs-lisp
(use-package ebib
  ;; :hook
  ;; (ebib-index-mode . (lambda () (evil-insert-state +1)))
  :custom
  (ebib-default-directory "~/Документы/Библиотека/")
  (ebib-preload-bib-files '("~/.bib/test.bib"))
  (ebib-import-source-directory "~/Загрузки/")
  (ebib-import-target-directory "~/Документы/Библиотека/")
  (ebib-bib-search-dirs "~/.bib")
  (ebib-bibtex-dialect 'biblatex)
  (ebib-truncate-file-names nil))
#+end_src

#+RESULTS:
: [nil 26953 27944 616377 nil elpaca-process-queues nil nil 839000 nil]

